const inventory = [];
let room = "Замок Искорки";

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "MY LITTLE PONY: БЕЗ МАГИИ ИСКОРКИ\n\n" +
    "Искорка сидела в своем замке и как обычно читала книги; но заметила, что ее магия ослабла. чтобы вернуть магию найдите все предметы:\n" +
    "лунный цветок, крылатый кристалл, магический самоцвет и ключ."
);

while (true) {
    if (room === "Замок Искорки") {
        const choice = prompt(
            "ВЫ В ЗАМКЕ ИСКОРКИ\n" +
            "1 — Выйти на улицу понивиля\n" +
            "2 — Изучить способности предметов\n" +
            "3 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Улица Понивиля";
        } else if (choice === "2") {
            const choice = prompt(
                "Лунный цветок помогает восстановить магию\n" +
                "Крылатый кристалл активирует защитный барьер\n" +
                "Магический самоцвет усиливает заклинание\n" +
                "Древний ключ открывает Храм Гармонии\n" +
                "1 — Вернуться\n" +
                "0 — Завершить игру"
            );
            if (choice === "0" || choice === null) {
                break;
            } else if (choice === "1") {
                room = "Замок Искорки";
            } else {
                alert("Такого прохода нет.");
            }
        }
    }
    else if (room === "Улица Понивиля") {
        const choice = prompt(
            "ВЫ НА УЛИЦЕ ПОНИВИЛЯ\n" +
            "1 — Отправиться в Вечнозеленый лес\n" +
            "2 — Подняться в Клаудсейл\n" +
            "3 — Отправиться в Бутик Рарити\n" +
            "4 — Отправиться в Королевскую библиотеку\n" +
            "5 — Отправиться в Храм Гармонии\n" +
            "6 — Отправиться в Замок Искорки\n" +
            "7 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Вечнозеленый лес";
        } else if (choice === "2") {
            room = "Клаудсейл"
        } else if (choice === "3") {
            room = "Бутик Рарити"
        } else if (choice === "4") {
            room = "Королевская библиотека"
        } else if (choice === "5") {
            room = "Храм Гармонии"
        } else if (choice === "6") {
            room = "Замок Искорки"
        } else if (choice === "7") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Вечнозеленый лес") {
        const choice = prompt(
            "ВЕЧНОЗЕЛЕНЫЙ ЛЕС\n" +
            "1 — Перейти болото\n" +
            "2 — Пройти сквозь лиан\n" +
            "3 — Войти в дом Зекоры\n" +
            "4 — Выйти  из леса\n" +
            "5 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Другой берег болота";
        } else if (choice === "2") {
            room = "Опушка";
        } else if (choice === "3") {
            room = "Дом Зекоры";
        } else if (choice === "4") {
            room = "Улица Понивиля";
        } else if (choice === "5") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Другой берег болота") {
        const choice = prompt(
            "ДРУГОЙ БЕРЕГ БОЛОТА\n" +
            "Тут ничего нет!:((\n" +
            "1 — Вернуться\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Вечнозеленый лес";
        } else if (choice === "2") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Опушка") {
        const choice = prompt(
            "Перед вами стоит полуразрушенный замок. Это бывшая резенденнция принцесс Селестии и Луны. Внутрь НЕЛЬЗЯ!!\n" +
            "1 — Вернуться в начало вечнозеленого леса\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Вечнозеленый лес";
        } else if (choice === "2") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Дом Зекоры") {
        const choice = prompt(
            "Может у Зекоры есть Лунный цветок? Поговори с ней!\n" +
            "1 — Поговорить с Зекорой\n" +
            "2 — Выйти из дома\n" +
            "3 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "2") {
            room = "Вечнозеленый лес";
        } else if (choice === "1") {
            const choice = prompt(
                "Зекора: Чтобы получить заветный цветок,\n" +
                " Разгадай загадку – вот мой урок:,\n" +
                " Не сорвешь её в поле, не купишь в ларьке,\n" +
                " Она живет лишь в добром и теплом сердце, в руке\n" +
                "1 — Дружба\n" +
                "2 — Мама\n" +
                "3 — Счастье\n" +
                "4 — Любовь\n" +
                "5 - Выйти из дома\n " +
                "6 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            );
            if (choice === "0" || choice === null) {
                break;
            } else if (choice === "1") {
                if (inventory.includes("Лунный цветок")) {
                    alert("Лунный цветок уже у вас.");
                } else {
                    const takeKey = confirm("Вы разгадали загадку! Возьмите его!");
                    if (takeKey === true) {
                        inventory.push("Луннный цветок");
                        alert("Лунный цветок добавлен в рюкзак!");
                    } else {
                        alert("Вы оставили Лунный цветок у Зекоры");
                    }
                }
            } else if (choice === "2") {
                alert("Неправильный ответ, подумай еще")
            } else if (choice === "3") {
                alert("Неправильный ответ, подумай еще")
            } else if (choice === "4") {
                alert("Неправильный ответ, подумай еще")
            } else if (choice === "5") {
                room = "Вечнозеленый лес"
            } else if (choice === "6") {
                showInventory();
            } else {
                alert("Такого прохода нет.");
            }
        } else if (choice === "3") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Клаудсейл") {
        const choice = prompt(
            "КЛАУДСЕЙЛ\n" +
            "1 — Отправиться на Фабрику Погоды\n" +
            "2 — Отправиться на Клаудсиум\n" +
            "3 — Войти в дом Радуги Дэш\n" +
            "4 — Спуститься на улицу Понивиля\n" +
            "5 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Фабрика Погоды";
        } else if (choice === "2") {
            room = "Клаудсиум";
        } else if (choice === "3") {
            room = "дом Радуги Дэш";
        } else if (choice === "4") {
            room = "Улица Понивиля";
        } else if (choice === "5") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Фабрика Погоды") {
        const choice = prompt(
            "ФАБРИКА ПОГОДЫ\n" +
            "1 — Поговорить с сотрудниками\n" +
            "2 — Пойти в кабинет директора фабрики\n" +
            "3 — Выйти\n" +
            "4 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Завод";
        } else if (choice === "2") {
            room = "Кабинет Директора";
        } else if (choice === "3") {
            room = "Клаудсейл";
        } else if (choice === "4") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Завод") {
        const choice = prompt(
            "ФАБРИКА ПОГОДЫ\n" +
            "Сотрудники: Мы ничего не знаем...Наша работа встала, теперь погода сама по себе\n" +
            "1 — Завершить разговор\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Фабрика Погоды";
        } else if (choice === "2") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Кабинет Директора") {
        const choice = prompt(
            "КАБИНЕТ ДИРЕКТОРА\n" +
            "В кабинете никого не оказалось.Есть возможность осмотретрь рабочую зону в спокойствии\n" +
            "1 — Заглянуть в стол\n" +
            "2 — Посмотреть шкаф\n" +
            "3 — Выйти\n" +
            "4 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            const choice = prompt(
                "КАБИНЕТ ДИРЕКТОРА\n" +
                "Тут только документы\n" +
                "1 — Выйти\n" +
                "3 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            );
            if (choice === "0" || choice === null) {
                break;
            } else if (choice === "1") {
                room = "Кабинет Директора";
            } else if (choice === "3") {
                showInventory();
            } else {
                alert("Такого прохода нет.");
            }
        } else if (choice === "2") {
            const choice = prompt(
                "КАБИНЕТ ДИРЕКТОРА\n" +
                "Кажется в этой шкатулке что-то есть\n" +
                "1 — Осмотреть шкатулку\n" +
                "2 — Выйти\n" +
                "3 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            );
            if (choice === "0" || choice === null) {
                break;
            } else if (choice === "1") {
                if (inventory.includes("ключ")) {
                    alert("Шкатулка пустая, Крылатый кристалл уже у вас.");
                } else {
                    const kr = confirm("В шкатулке лежит Крылатый кристалл. Взять его?");
                    if (kr === true) {
                        inventory.push("Крылатый кристалл");
                        alert("Крылатый кристалл добавлен в рюкзак!");
                    } else {
                        alert("Вы оставили Крылатый кристалл в сундуке.");
                    }
                }
            } else if (choice === "2") {
                room = "Фабрика Погоды";
            } else if (choice === "3") {
                showInventory();
            } else {
                alert("Такого прохода нет.");
            }
        } else if (choice === "3") {
            room = "Фабрика Погоды";
        } else if (choice === "4") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "дом Радуги Дэш") {
        const choice = prompt(
            "ДОМ РАДУГИ ДЭШ\n" +
            "В доме была сама радуга и флаттершай\n" +
            "1 — Поговорить с подругами\n" +
            "2 — Выйти из дома\n" +
            "3 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Комната дэш"
        } else if (choice === "2") {
            room = "Клаудсейл";
        } else if (choice === "3") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Комната дэш") {
        const choice = prompt(
            "ДОМ РАДУГИ ДЭШ\n" +
            "Радуга Дэш: Флаттершай прилетела, когда еще была магия.Без магии мы не спустимся\n" +
            "Флаттершай: Энджел наверно проголодался там без меня...\n" +
            "1 — Выйти из дома\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Клаудсейл";
        } else if (choice === "2") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if (room === "Клаудсиум") {
        const choice = prompt(
            "КЛАУДСИУМ\n" +
            "Еще вчера здесь тренрировались будущие чудо молнии\n" +
            "Здесь нечего осматривать\n" +
            "1 — Выйти\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Клаудсейл";
        } else if (choice === "2") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
}

alert("Игра завершена.");
