const inventory = []
let room = "Замок Искорки"

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.")
    } else {
        alert("В рюкзаке: " + inventory.join(", "))
    }
}

alert(
    "MY LITTLE PONY: ПОИСК МАГИИ\n" +
    "Искорка сидела в своем замке и как обычно читала книги  но заметила, что магия ослабла. чтобы вернуть магию найдите все предметы:\n" +
    "лунный цветок, крылатый кристалл, магический самоцвет и ключ."
)

while (true) {
    if (room === "Замок Искорки") {
        const choice = prompt(
            "ВЫ В ЗАМКЕ ИСКОРКИ\n" +
            "1 — Выйти на улицу понивиля\n" +
            "2 — Изучить способности предметов\n" +
            "3 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Улица Понивиля"
        } else if (choice === "2") {
            const choice = prompt(
                "Лунный цветок помогает восстановить магию\n" +
                "Крылатый кристалл активирует защитный барьер\n" +
                "Магический самоцвет усиливает заклинание\n" +
                "Древний ключ открывает Храм Гармонии\n" +
                "1 — Вернуться\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                room = "Замок Искорки"
            } else {
                alert("Такого варианта нет.")
            }
        } else if (choice === "3") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Улица Понивиля") {
        const choice = prompt(
            "ВЫ НА УЛИЦЕ ПОНИВИЛЯ\n" +
            "1 — Отправиться в Вечнозеленый лес\n" +
            "2 — Подняться в Клаудсейл\n" +
            "3 — Отправиться в Бутик Рарити\n" +
            "4 — Отправиться в Королевскую библиотеку\n" +
            "5 — Отправиться в Храм Гармонии\n" +
            "6 — Отправиться в Замок Искорки\n" +
            "7 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Вечнозеленый лес"
        } else if (choice === "2") {
            room = "Клаудсейл"
        } else if (choice === "3") {
            room = "Бутик Рарити"
        } else if (choice === "4") {
            room = "Королевская библиотека"
        } else if (choice === "5") {
            room = "Храм Гармонии"
        } else if (choice === "6") {
            room = "Замок Искорки"
        } else if (choice === "7") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Вечнозеленый лес") {
        const choice = prompt(
            "ВЕЧНОЗЕЛЕНЫЙ ЛЕС\n" +
            "1 — Перейти болото\n" +
            "2 — Пройти сквозь лиан\n" +
            "3 — Войти в дом Зекоры\n" +
            "4 — Выйти  из леса\n" +
            "5 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Другой берег болота"
        } else if (choice === "2") {
            room = "Опушка"
        } else if (choice === "3") {
            room = "Дом Зекоры"
        } else if (choice === "4") {
            room = "Улица Понивиля"
        } else if (choice === "5") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Другой берег болота") {
        const choice = prompt(
            "ДРУГОЙ БЕРЕГ БОЛОТА\n" +
            "Тут ничего нет!:((\n" +
            "1 — Вернуться\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Вечнозеленый лес"
        } else if (choice === "2") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Опушка") {
        const choice = prompt(
            "ЗА ЛИАНАМИ\n" +
            "Перед вами стоит полуразрушенный замок. Это бывшая резенденнция принцесс Селестии и Луны. Внутрь НЕЛЬЗЯ!!\n" +
            "1 — Вернуться в начало вечнозеленого леса\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Вечнозеленый лес"
        } else if (choice === "2") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Дом Зекоры") {
        if (inventory.includes("Лунный цветок")) {
            const choice = prompt(
                "ДОМ ЗЕКОРЫ\n" +
                "Тут больше нечего делать\n" +
                "1 — Выйти из дома\n" +
                "2 — Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                room = "Вечнозеленый лес"
            } else if (choice === "2") {
                showInventory()
            } else {
                alert("Такого варианта нет.")
            }
        } else {
            const choice = prompt(
                "ДОМ ЗЕКОРЫ\n" +
                "Может у Зекоры есть Лунный цветок? Поговори с ней!\n" +
                "1 — Поговорить с Зекорой\n" +
                "2 — Выйти из дома\n" +
                "3 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "2") {
                room = "Вечнозеленый лес"
            } else if (choice === "1") {
                while (true) {
                    const choice = prompt(
                        "ДОМ ЗЕКОРЫ\n" +
                        "Зекора: Чтобы получить заветный цветок,\n" +
                        " Разгадай загадку – вот мой урок:,\n" +
                        " Не сорвешь её в поле, не купишь в ларьке,\n" +
                        " Она живет лишь в добром и теплом сердце, в руке\n" +
                        "1 — Дружба\n" +
                        "2 — Мама\n" +
                        "3 — Счастье\n" +
                        "4 — Любовь\n" +
                        "5 - Выйти из дома\n " +
                        "6 - Проверить рюкзак\n" +
                        "0 — Завершить игру"
                    )
                    if (choice === "0" || choice === null) {
                        room = "выход"
                        break
                    } else if (choice === "1") {
                        if (inventory.includes("Лунный цветок")) {
                            alert("Лунный цветок уже у вас.")
                        } else {
                            const takeKey = confirm("Вы разгадали загадку! Взять цветок?")

                            if (takeKey === true) {
                                inventory.push("Лунный цветок")
                                alert("Лунный цветок взят!")
                            } else {
                                alert("Вы оставили Лунный цветок.")
                            }
                        }
                        break
                    } else if (choice === "2") {
                        alert("Неправильный ответ, подумай еще")
                    } else if (choice === "3") {
                        alert("Неправильный ответ, подумай еще")
                    } else if (choice === "4") {
                        alert("Неправильный ответ, подумай еще")
                    } else if (choice === "5") {
                        room = "Вечнозеленый лес"
                        break
                    } else if (choice === "6") {
                        showInventory()
                    } else {
                        alert("Такого варианта нет.")
                    }
                }
            } else if (choice === "3") {
                showInventory()
            } else {
                alert("Такого варианта нет.")
            }
        }
    } else if (room === "Клаудсейл") {
        const choice = prompt(
            "КЛАУДСЕЙЛ\n" +
            "1 — Отправиться на Фабрику Погоды\n" +
            "2 — Отправиться на Клаудсиум\n" +
            "3 — Войти в дом Радуги Дэш\n" +
            "4 — Спуститься на улицу Понивиля\n" +
            "5 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Фабрика Погоды"
        } else if (choice === "2") {
            room = "Клаудсиум"
        } else if (choice === "3") {
            room = "дом Радуги Дэш"
        } else if (choice === "4") {
            room = "Улица Понивиля"
        } else if (choice === "5") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Фабрика Погоды") {
        const choice = prompt(
            "ФАБРИКА ПОГОДЫ\n" +
            "1 — Поговорить с сотрудниками\n" +
            "2 — Пойти в кабинет директора фабрики\n" +
            "3 — Выйти\n" +
            "4 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Завод"
        } else if (choice === "2") {
            room = "Кабинет Директора"
        } else if (choice === "3") {
            room = "Клаудсейл"
        } else if (choice === "4") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Завод") {
        const choice = prompt(
            "ФАБРИКА ПОГОДЫ\n" +
            "Сотрудники: Мы ничего не знаем...Наша работа встала, теперь погода сама по себе\n" +
            "1 — Завершить разговор\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Фабрика Погоды"
        } else if (choice === "2") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Кабинет Директора") {
        const choice = prompt(
            "КАБИНЕТ ДИРЕКТОРА\n" +
            "В кабинете никого не оказалось.Есть возможность осмотретрь рабочую зону в спокойствии\n" +
            "1 — Заглянуть в стол\n" +
            "2 — Посмотреть шкаф\n" +
            "3 — Выйти\n" +
            "4 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            const choice = prompt(
                "КАБИНЕТ ДИРЕКТОРА\n" +
                "Тут только документы\n" +
                "1 — Выйти\n" +
                "3 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                room = "Кабинет Директора"
            } else if (choice === "3") {
                showInventory()
            } else {
                alert("Такого прохода нет.")
            }
        } else if (choice === "2") {
            const choice = prompt(
                "КАБИНЕТ ДИРЕКТОРА\n" +
                "Кажется в этой шкатулке что-то есть\n" +
                "1 — Осмотреть шкатулку\n" +
                "2 — Выйти\n" +
                "3 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                if (inventory.includes("Крылатый кристалл")) {
                    alert("тут пусто. Крылатый кристалл уже у вас.")
                } else {
                    const takeKey = confirm("Вы нашли Крылатый кристалл. Взять его?")

                    if (takeKey === true) {
                        inventory.push("Крылатый кристалл")
                    } else {
                        alert("Вы Крылатый кристалл на кровати.")
                    }
                }
            } else if (choice === "2") {
                room = "Фабрика Погоды"
            } else if (choice === "3") {
                showInventory()
            } else {
                alert("Такого варианта нет.")
            }
        } else if (choice === "3") {
            room = "Фабрика Погоды"
        } else if (choice === "4") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "дом Радуги Дэш") {
        const choice = prompt(
            "ДОМ РАДУГИ ДЭШ\n" +
            "В доме была сама радуга и флаттершай\n" +
            "1 — Поговорить с подругами\n" +
            "2 — Выйти из дома\n" +
            "3 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Комната дэш"
        } else if (choice === "2") {
            room = "Клаудсейл"
        } else if (choice === "3") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Комната дэш") {
        const choice = prompt(
            "ДОМ РАДУГИ ДЭШ\n" +
            "Радуга Дэш: Флаттершай прилетела, когда еще была магия.Без магии мы не спустимся\n" +
            "Флаттершай: Энджел наверно проголодался там без меня...\n" +
            "1 — Выйти из дома\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Клаудсейл"
        } else if (choice === "2") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Клаудсиум") {
        const choice = prompt(
            "КЛАУДСИУМ\n" +
            "Еще вчера здесь тренировались будущие чудо молнии\n" +
            "Здесь нечего осматривать\n" +
            "1 — Выйти\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Клаудсейл"
        } else if (choice === "2") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Бутик Рарити") {
        if (inventory.includes("Магический самоцвет")) {
            const choice = prompt(
                "БУТТИК РАРИТИ\n" +
                "За столом пили чай Рарити, Эпл Джек и Пинки Пай\n" +
                "1 — Выйти из Бутика\n" +
                "2 — Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                room = "Улица Понивиля"
            } else if (choice === "2") {
                showInventory()
            } else {
                alert("Такого варианта нет.")
            }
        } else {
            const choice = prompt(
                "БУТТИК РАРИТИ\n" +
                "За столом пили чай Рарити и Эпл Джек. А Пинки Пай несла с кухни торт\n" +
                "1 — Поговорить с подругами\n" +
                "2 — Выйти из Бутика\n" +
                "3 - Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                alert("Эпл Джек: Я верю что ты вернешь магию")
                alert("Пинки Пай: ЧТО? МАГИЯ ПРОПАЛА?!")
                const choice = prompt(
                    "БУТТИК РАРИТИ\n" +
                    "Рарити: Дорогуша, я знаю зачем ты тут\n" +
                    "То что ты ищешь есть у меня в сундуке с тканями\n" +
                    "1 — Поблагодарить\n" +
                    "2 — Подойти к сундуку\n" +
                    "3 - Выйти\n" +
                    "4 - Проверить рюкзак\n" +
                    "0 — Завершить игру"
                )
                if (choice === "0" || choice === null) {
                    break
                } else if (choice === "1") {
                    const choice = prompt(
                        "БУТТИК РАРИТИ\n" +
                        "Рарити: Всегда пожалуйста, только верни магию поскорее\n" +
                        "1 — Подойти к сундуку\n" +
                        "2 - Выйти\n" +
                        "3 - Проверить рюкзак\n" +
                        "0 — Завершить игру"
                    )
                    if (choice === "0" || choice === null) {
                        break
                    } else if (choice === "1") {
                        while (room === "Бутик Рарити") {
                            const choice = prompt(
                                "БУТТИК РАРИТИ\n" +
                                "Так, под какой тканью он...\n" +
                                "1 — Под желтой\n" +
                                "2 — Под зеленой\n" +
                                "3 — Под нефритовой\n" +
                                "4 — Выйти\n" +
                                "0 — Завершить игру"
                            )
                            if (choice === "0" || choice === null) {
                                break
                            } else if (choice === "3") {
                                if (inventory.includes("Магический самоцвет")) {
                                    alert("Тут пусто. Магический самоцвет уже у вас.")
                                } else {
                                    const takeKey = confirm("Вы нашли Магический самоцвет. Взять его?")
                                    if (takeKey === true) {
                                        inventory.push("Магический самоцвет")
                                        alert("Магический самоцвет у вас!")
                                    } else {
                                        alert("Вы оставили Магический самоцвет.")
                                    }
                                }
                                break
                            } else if (choice === "2") {
                                alert("Тут ничего нет")
                            } else if (choice === "1") {
                                alert("Тут ничего нет")
                            } else if (choice === "4") {
                                room = "Бутик Рарити"
                            } else {
                                alert("Такого варианта нет.")
                            }
                        }
                    } else if (choice === "2") {
                        room = "Улица Понивиля"
                    } else if (choice === "3") {
                        showInventory();
                    } else {
                        alert("Такого варианта нет.")
                    }
                } else if (choice === "2") {
                    while (room === "Бутик Рарити") {
                        const choice = prompt(
                            "БУТТИК РАРИТИ\n" +
                            "Так, под какой тканью он...\n" +
                            "1 — Под желтой\n" +
                            "2 — Под зеленой\n" +
                            "3 — Под нефритовой\n" +
                            "4 — Выйти\n" +
                            "0 — Завершить игру"
                        )
                        if (choice === "0" || choice === null) {
                            room = "выход"
                            break
                        } else if (choice === "3") {
                            if (inventory.includes("Магический самоцвет")) {
                                alert("Тут пусто. Магический самоцвет уже у вас.")
                            } else {
                                const takeKey = confirm("Вы нашли Магический самоцвет. Взять его?")
                                if (takeKey === true) {
                                    inventory.push("Магический самоцвет")
                                    alert("Магический самоцвет у вас!")
                                } else {
                                    alert("Вы оставили Магический самоцвет.")
                                }
                            }
                            break
                        } else if (choice === "2") {
                            alert("Тут ничего нет")
                        } else if (choice === "1") {
                            alert("Тут ничего нет")
                        } else if (choice === "4") {
                            room = "Бутик Рарити"
                            break
                        } else {
                            alert("Такого варианта нет.")
                        }
                    }
                } else if (choice === "3") {
                    room = "Улица Понивиля"
                } else if (choice === "4") {
                    showInventory()
                } else {
                    alert("Такого варианта нет.")
                }
            } else if (choice === "2") {
                room = "Улица Понивиля"
            } else if (choice === "3") {
                showInventory()
            } else {
                alert("Такого варианта нет.")
            }
        }
    }
    else if (room === "Королевская библиотека") {
        const choice = prompt(
            "КОРОЛЕВСКАЯ БИБИЛИОТЕКА\n" +
            "1 — Подняться на второй этаж\n" +
            "2 — Спуститься в подвал\n" +
            "3 — Подойти к книжным полкам\n" +
            "4 — Выйти из библиотеки\n" +
            "5 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        }
        else if (choice === "1") {
            room = "Второй этаж"
        }
        else if (choice === "2") {
            room = "Подвал"
        }
        else if (choice === "3") {
            room = "Книжная полка"
        }
        else if (choice === "4") {
            room = "Улица Понивиля"
        }
        else if (choice === "5") {
            showInventory()
        }
        else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Второй этаж") {
        const choice = prompt(
            "ВТОРОЙ ЭТАЖ\n" +
            "Перед вами ряды книжных полок и зона отдыха. Жаль, что нет времени на поиски тут\n" +
            "1 — Вернуться\n" +
            "2 - Проверить рюкзак\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            room = "Королевская библиотека"
        } else if (choice === "2") {
            showInventory()
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Подвал") {
        const choice = prompt(
            "ПОДВАЛ\n" +
            "Как и во всех играх здесь явно что-то есть..\n" +
            "1 — Заглянуть в бочки\n" +
            "2 — Осмотреть ящик в углу\n" +
            "3 — Заглянуть под выпирающую половицу\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться в библиотеку\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        }
        else if (choice === "1") {
            const subChoice = prompt(
                "ПОДВАЛ\n" +
                "В бочках знаменитый яблочный сок от семьи Эпл.\n" +
                "Больше ничего.\n" +
                "1 — Вернуться\n" +
                "2 — Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (subChoice === "0" || subChoice === null) {
                break
            } else if (subChoice === "2") {
                showInventory()
            }
        }
        else if (choice === "2") {
            const subChoice = prompt(
                "ПОДВАЛ\n" +
                "В ящике есть лишь какая-то записка\n" +
                "1 — Осмотреть записку\n" +
                "2 — Вернуться\n" +
                "3 — Проверить рюкзак\n" +
                "0 — Завершить игру"
            )
            if (subChoice === "0" || subChoice === null) {
                break
            } else if (subChoice === "1") {
                if (inventory.includes("Записка")) {
                    alert("Тут пусто. Записка уже у вас.")
                } else {
                    const takeKey = confirm("Прочитать записку?")
                    if (takeKey === true) {
                        inventory.push("Записка")
                        alert("«В час великого испытания судьба Эквестрии окажется в руках лишь одной волшебницы. Но горе ей, если она решит, что великий Кристалл подчинится обычному колдовству. Пророчество гласит: если призвать Кристалл лишь силой разума и книжных заклинаний, магия вспыхнет лишь наполовину. Такой свет обманчив — он продержится лишь временно, и когда угаснет последняя искра, вечная тьма поглотит наш мир навсегда. Чтобы зажечь Кристалл на всю его мощь и подарить Эквестрии вечный мир, избранная должна совершить невозможное: объединить силу своего разума с силой своего сердца. Ключ к этому сокрыт в древнем Свитке Истинной Гармонии. Только строки этого свитка укажут, как пробудить внутри себя Магию Дружбы и превратить любовь к близким в нерушимый свет.»")
                    } else {
                        alert("Вы решили не читать записку.")
                    }
                }
            } else if (subChoice === "3") {
                showInventory()
            }
        }
        else if (choice === "3") {
            if (inventory.includes("Ключ")) {
                alert("Тут пусто. Ключ уже у вас.")
            } else {
                const takeKey = confirm("Взять ключ?")
                if (takeKey === true) {
                    inventory.push("Ключ")
                    alert("Теперь можно открыть Храм Гармонии!")
                } else {
                    alert("Вы оставили ключ.")
                }
            }
        }
        else if (choice === "4") {
            showInventory()
        }
        else if (choice === "5") {
            room = "Королевская библиотека"
        }
        else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Книжная полка") {
        const choice = prompt(
            "КНИЖНЫЕ ПОЛКИ\n" +
            "Тут книг больше чем в библиотеки Искорки\n" +
            "1 — Взять книгу\n" +
            "2 - Проверить рюкзак\n" +
            "3 - Выйти\n" +
            "0 — Завершить игру"
        )

        if (choice === "0" || choice === null) {
            break
        } else if (choice === "1") {
            if (inventory.includes("Свиток Истинной Гармонии")) {
                alert("Тут пусто. Свиток Истинной Гармонии уже у вас.")
            } else {
                const takeKey = confirm("В книге лежал Свиток Истинной Гармонии. Взять его?")
                if (takeKey === true) {
                    inventory.push("Свиток Истинной Гармонии")
                    alert("Свиток Истинной Гармонии у вас!")
                } else {
                    alert("Вы оставили Свиток Истинной Гармонии.")
                }
            }
        } else if (choice === "2") {
            showInventory()
        } else if (choice === "3") {
            room = "Королевская библиотека"
        } else {
            alert("Такого варианта нет.")
        }
    }
    else if (room === "Храм Гармонии") {
        if (inventory.includes("Ключ")) {
            const choice = prompt(
                "ХРАМ ГАРМОНИИ\n" +
                "Пора восстановить магию\n" +
                "1 — Подойти к Кристаллу магии\n" +
                "2 — Проверить рюкзак\n" +
                "3 — Выйти\n" +
                "0 — Завершить игру"
            )
            if (choice === "0" || choice === null) {
                break
            } else if (choice === "1") {
                room = "Кристаллл"
            } else if (choice === "3") {
                room = "Улица Понивиля"
            } else if (choice === "2") {
                showInventory()
            } else {
                alert("Такого варианта нет.")
            }
            if (room === "Кристаллл") {
                const hasAllItems = inventory.includes("Лунный цветок") &&
                    inventory.includes("Крылатый кристалл") &&
                    inventory.includes("Магический самоцвет")

                const hasScroll = inventory.includes("Свиток Истинной Гармонии")

                if (hasAllItems) {
                    if (hasScroll) {
                        // КОНЦОВКА 1
                        alert(
                            "МАГИЯ ВОССТАНОВЛЕНА ПОЛНОСТЬЮ!\n\n" +
                            "Искорка объединила силу своего разума со знанием из Древнего Свитка.\n" +
                            "Магия вспыхнула ярким, неземным светом и вернулась в Эквестрию НАВСЕГДА!\n" +
                            "Вы прошли игру на идеальную концовку!"
                        )
                    } else {
                        // КОНЦОВКА 2
                        alert(
                            "ПОТЕРЯННОЕ ПРОРОЧЕСТВО\n\n" +
                            "Вы нашли все предметы, и магия вернулась... но лишь НАПОЛОВИНУ.\n" +
                            "Без Древнего Свитка заклинание оказалось нестабильным.\n" +
                            "Этот свет продержится лишь временно. Попробуйте переиграть!"
                        )
                    }
                    break
                }
                else {
                    // КОНЦОВКА 3
                    alert(
                        "ВЕЧНАЯ ТЬМА\n\n" +
                        "Вы пришли в Храм Гармонии, но не хватило артефактов для восстановления баланса.\n" +
                        "Магия ПОЛНОСТЬЮ ИСЧЕЗЛА. Пони навсегда лишились своих сил,\n" +
                        "а замок погрузился в непроглядную тьму. Попробуйте снова!"
                    )
                    break  // Выход из главного цикла (завершение игры)
                }
            }
        } else {
            alert("У вас нет ключа")
            room = "Улица Понивиля"
        }
    }
}
alert("Игра завершена.") 
